
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1 概述 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../Chapter-2/2_QP.html" />
    
    
    <link rel="prev" href="../缩略语.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../缩略语.html">
            
                <a href="../缩略语.html">
            
                    
                    缩略语
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="1_概述.html">
            
                <a href="1_概述.html">
            
                    
                    1 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Chapter-2/2_QP.html">
            
                <a href="../Chapter-2/2_QP.html">
            
                    
                    2 QP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Chapter-3/3_RC.html">
            
                <a href="../Chapter-3/3_RC.html">
            
                    
                    3 码率控制模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Chapter-3/3-1_CBR.html">
            
                <a href="../Chapter-3/3-1_CBR.html">
            
                    
                    3.1 CBR
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../Chapter-3/3-2_VBR.html">
            
                <a href="../Chapter-3/3-2_VBR.html">
            
                    
                    3.2 VBR
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../Chapter-3/3-3_ABR.html">
            
                <a href="../Chapter-3/3-3_ABR.html">
            
                    
                    3.3 ABR
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../Chapter-3/3-4_CQP.html">
            
                <a href="../Chapter-3/3-4_CQP.html">
            
                    
                    3.4 CQP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="../Chapter-3/3-5_FIXQP.html">
            
                <a href="../Chapter-3/3-5_FIXQP.html">
            
                    
                    3.5 FIXQP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="../Chapter-3/3-6_QPMAP.html">
            
                <a href="../Chapter-3/3-6_QPMAP.html">
            
                    
                    3.6 QPMAP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.7" data-path="../Chapter-3/3-7_CRF.html">
            
                <a href="../Chapter-3/3-7_CRF.html">
            
                    
                    3.7 CRF
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Chapter-4/4_工具推荐.html">
            
                <a href="../Chapter-4/4_工具推荐.html">
            
                    
                    4 工具推荐
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../Chapter-5/5_FAQ.html">
            
                <a href="../Chapter-5/5_FAQ.html">
            
                    
                    5 FAQ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../Chapter-6/6_参考.html">
            
                <a href="../Chapter-6/6_参考.html">
            
                    
                    6 参考
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >1 概述</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="1-&#x6982;&#x8FF0;">1 &#x6982;&#x8FF0;</h2>
<hr>
<p><strong>&#x5728;&#x4ECB;&#x7ECD;&#x7801;&#x7387;&#x63A7;&#x5236;&#x4E4B;&#x524D;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x4E00;&#x70B9;&#xFF0C;&#x7801;&#x7387;&#x63A7;&#x5236;&#x4E0D;&#x662F; H.264/H.265 &#x6807;&#x51C6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x6807;&#x51C6;&#x7EC4;&#x6709;&#x53D1;&#x5E03;&#x975E;&#x89C4;&#x8303;&#x6307;&#x5357;&#x6765;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x8BBE;&#x8BA1;&#x5B9E;&#x73B0;&#x7801;&#x7387;&#x63A7;&#x5236;&#x3002;</strong> <br></p>
<p>&#x7801;&#x7387;&#x63A7;&#x5236;&#xFF08;RC&#xFF09;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5B9E;&#x73B0;&#x89C6;&#x9891;&#x7684;&#x6700;&#x4F73;&#x4F53;&#x9A8C;&#xFF0C;&#x8FD9;&#x91CC;&#x4E4B;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x201C;&#x6700;&#x4F73;&#x89C6;&#x89C9;&#x8D28;&#x91CF;&#x201D;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x201C;&#x6700;&#x4F73;&#x4F53;&#x9A8C;&#x201D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x56FE;&#x50CF;&#x753B;&#x8D28;&#x5F88;&#x597D;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x90A3;&#x4E48;&#x5173;&#x6CE8;&#x7801;&#x7387;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7ECF;&#x5E38;&#x8BF4;&#x7684;&#x753B;&#x8D28;&#x4F18;&#x5148;&#xFF1B;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7801;&#x7387;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x5BF9;&#x753B;&#x8D28;&#x7684;&#x8981;&#x6C42;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x9AD8;&#xFF0C;&#x5373;&#x7801;&#x7387;&#x4F18;&#x5148;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7801;&#x7387;&#x63A7;&#x5236;&#x7B56;&#x7565;&#x3002; <br></p>
<p>&#x7801;&#x7387;&#x63A7;&#x5236;&#x7B97;&#x6CD5;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x7F16;&#x7801;&#x5668;&#x53C2;&#x6570;&#x4EE5;&#x5B9E;&#x73B0;&#x76EE;&#x6807;&#x7801;&#x7387;&#x3002;&#x5B83;&#x5C06;&#x6BD4;&#x7279;&#x9884;&#x7B97;&#x5206;&#x914D;&#x7ED9;&#x89C6;&#x9891;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x6BCF;&#x7EC4;&#x56FE;&#x7247;&#x3001;&#x5355;&#x4E2A;&#x56FE;&#x7247;&#x6216;&#x5B50;&#x56FE;&#x7247;&#x3002;<br></p>
<p>H.264 &#x53CA; H.265 &#x538B;&#x7F29;&#x8FC7;&#x7A0B;&#x662F;&#x6709;&#x635F;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x4EC5;&#x901A;&#x8FC7;&#x4ECE;&#x6BD4;&#x7279;&#x6D41;&#x4E2D;&#x5220;&#x9664;&#x771F;&#x6B63;&#x5197;&#x4F59;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x5B9E;&#x73B0;&#x538B;&#x7F29;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x901A;&#x8FC7;&#x4EE5;&#x6700;&#x5C0F;&#x7A0B;&#x5EA6;&#x53EF;&#x5BDF;&#x89C9;&#x7684;&#x65B9;&#x5F0F;&#x505A;&#x51FA;&#x5C0F;&#x7684;&#x8D28;&#x91CF;&#x59A5;&#x534F;&#x6765;&#x5B9E;&#x73B0;&#x538B;&#x7F29;&#x3002;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x8C03;&#x8282;&#x91CF;&#x5316;&#x53C2;&#x6570; QP &#x6765;&#x51B3;&#x5B9A;&#x4FDD;&#x5B58;&#x591A;&#x5C11;&#x7A7A;&#x95F4;&#x7EC6;&#x8282;&#x3002;&#x5F53; QP &#x975E;&#x5E38;&#x5C0F;&#x65F6;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x90FD;&#x4F1A;&#x88AB;&#x4FDD;&#x7559;&#x3002;&#x968F;&#x7740; QP &#x7684;&#x589E;&#x52A0;&#xFF0C;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x4F1A;&#x88AB;&#x805A;&#x5408;&#xFF0C;&#x4ECE;&#x800C;&#x6BD4;&#x7279;&#x7387;&#x4E0B;&#x964D;&#xFF0C;&#x4F46;&#x4EE3;&#x4EF7;&#x662F;&#x5931;&#x771F;&#x5EA6;&#x6709;&#x6240;&#x589E;&#x52A0;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x8D28;&#x91CF;&#x635F;&#x5931;&#x3002; <br></p>
<p>&#x5148;&#x5BF9;&#x6BD4;&#x4E00;&#x4E0B; H.264 &#x548C; H.265 &#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF1A;</p>
<table>
<thead>
<tr>
<th></th>
<th>H.264 AVC</th>
<th>H.265 HEVC</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x5757;&#x5927;&#x5C0F;</td>
<td>&#x5B8F;&#x5757; 16x16</td>
<td>&#x5177;&#x6709;&#x4ECE; 64x64 &#x5230; 8x8 &#x7684;&#x6811;&#x72B6;&#x7F16;&#x7801;&#x7ED3;&#x6784;&#x7684;&#x5757;</td>
</tr>
<tr>
<td>&#x9884;&#x6D4B;&#x5757;</td>
<td>&#x5206;&#x88C2;&#x81F3; 4x4</td>
<td>64x64 &#x5230; 4x4 + &#x975E;&#x5BF9;&#x79F0;&#x9884;&#x6D4B;</td>
</tr>
<tr>
<td>&#x8F6C;&#x6362;&#x5757;</td>
<td>8x8 &#x548C; 4x4</td>
<td>32x32&#x3001;16x16&#x3001;8x8&#x3001;4x4 + &#x975E;&#x65B9;&#x5F62;&#x53D8;&#x6362;</td>
</tr>
<tr>
<td>&#x9006;&#x53D8;&#x6362;</td>
<td>&#x53BB;&#x5757;&#x6548;&#x5E94;&#x6EE4;&#x6CE2;&#x5668;</td>
<td>&#x89E3;&#x9501;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;SAO</td>
</tr>
<tr>
<td>&#x5E27;&#x5185;&#x9884;&#x6D4B;</td>
<td>9&#x79CD;&#x6A21;&#x5F0F;</td>
<td>35&#x79CD;&#x6A21;&#x5F0F;</td>
</tr>
<tr>
<td>&#x8FD0;&#x52A8;&#x8865;&#x507F;</td>
<td>&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x9884;&#x6D4B;</td>
<td>&#x9AD8;&#x7EA7;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x9884;&#x6D4B;&#xFF08;&#x7A7A;&#x95F4;&#x548C;&#x65F6;&#x95F4;&#xFF09;</td>
</tr>
<tr>
<td>&#x989C;&#x8272;&#x6DF1;&#x5EA6;</td>
<td>8&#x4F4D;</td>
<td>10&#x4F4D;</td>
</tr>
<tr>
<td>&#x71B5;&#x7F16;&#x7801;</td>
<td>CABAC &#x6216; CAVLC</td>
<td>&#x5E76;&#x884C;&#x64CD;&#x4F5C;&#x7684; CABAC</td>
</tr>
</tbody>
</table>
<p>&#x8FD9;&#x91CC;&#x5148;&#x4E86;&#x89E3;&#x51E0;&#x4E2A;&#x4E0E;&#x7801;&#x7387;&#x63A7;&#x5236;&#x6709;&#x5173;&#x7684;&#x672F;&#x8BED;&#xFF1A;</p>
<h5 id="&#x9884;&#x6D4B;">&#x9884;&#x6D4B;</h5>
<p>H.264 &#x548C; MPEG-* &#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F20;&#x7EDF;&#x7684;&#x5E27;&#x95F4;&#xFF08;&#x65F6;&#x95F4;&#xFF09;&#x9884;&#x6D4B;&#x6765;&#x9884;&#x6D4B;&#x5B8F;&#x5757;&#xFF0C;&#x5373;&#x6839;&#x636E;&#x5148;&#x524D;&#x7684;&#x53C2;&#x8003;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x8FD0;&#x52A8;&#x4F30;&#x8BA1;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x8F93;&#x8FD0;&#x52A8;&#x77E2;&#x91CF;&#x3002;&#x6B64;&#x5916;&#xFF0C;H.264 &#x652F;&#x6301;&#x6839;&#x636E;&#x5DF2;&#x7F16;&#x7801;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6309;&#x5149;&#x6805;&#x626B;&#x63CF;&#x987A;&#x5E8F;&#xFF09;&#x7684;&#x76F8;&#x90BB;&#x50CF;&#x7D20;&#x7684;&#x7F16;&#x7801;&#x503C;&#x5BF9;&#x5B8F;&#x5757;&#x8FDB;&#x884C;&#x9AD8;&#x7EA7;&#x5E27;&#x5185;&#xFF08;&#x7A7A;&#x95F4;&#xFF09;&#x9884;&#x6D4B;&#x3002; <br></p>
<h5 id="&#x6B8B;&#x5DEE;">&#x6B8B;&#x5DEE;</h5>
<p>&#x6E90;&#x4FE1;&#x53F7;&#x548C;&#x9884;&#x6D4B;&#x4FE1;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x79F0;&#x4E3A;&#x6B8B;&#x5DEE;&#x6216;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#x3002;&#x7136;&#x540E;&#x5BF9;&#x6B8B;&#x5DEE;&#x5E94;&#x7528;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x4EE5;&#x4EA7;&#x751F;&#x53D8;&#x6362;&#x7CFB;&#x6570;&#xFF0C;&#x8BE5;&#x53D8;&#x6362;&#x7CFB;&#x6570;&#x643A;&#x5E26;&#x5728;&#x9884;&#x6D4B;&#x672C;&#x8EAB;&#x6216;&#x5176;&#x53C2;&#x8003;&#x56FE;&#x7247;&#x4E2D;&#x672A;&#x6355;&#x83B7;&#x7684;&#x4EFB;&#x4F55;&#x7A7A;&#x95F4;&#x7EC6;&#x8282;&#x3002; <br></p>
<h5 id="&#x626D;&#x66F2;">&#x626D;&#x66F2;</h5>
<p>&#x5931;&#x771F;&#x662F;&#x6307;&#x539F;&#x59CB;&#x6E90;&#x56FE;&#x50CF; x &#x4E0E;&#x89E3;&#x7801;&#x540E;&#x7684;&#x91CD;&#x5EFA;&#x56FE;&#x50CF; y &#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x516C;&#x5F0F;4&#x5728; H.264 &#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55; N &#x4E2A;&#x50CF;&#x7D20;&#x96C6;&#xFF0C;&#x4F7F;&#x7528;&#x5E73;&#x65B9;&#x5DEE;&#x548C;&#x5C06;&#x5931;&#x771F;&#x91CF;&#x5316;&#x4E3A; (1/N) i |yi &#x2013; xi |2&#x3002;</p>
<h5 id="&#x590D;&#x6742;&#x5EA6;">&#x590D;&#x6742;&#x5EA6;</h5>
<p>&#x4FD7;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x5B9A;&#x4E49;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4F46;&#x5F53;&#x6211;&#x770B;&#x5230;&#x5B83;&#x65F6;&#x6211;&#x5C31;&#x77E5;&#x9053;&#x5B83;&#xFF01;&#x5982;&#x679C;&#x5355;&#x4E2A;&#x6E90;&#x56FE;&#x7247;&#x201C;&#x7E41;&#x5FD9;&#x201D;&#x5E76;&#x4E14;&#x5177;&#x6709;&#x5927;&#x91CF;&#x7A7A;&#x95F4;&#x7EC6;&#x8282;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4F1A;&#x5F88;&#x590D;&#x6742;&#x3002;&#x672F;&#x8BED;&#x7A7A;&#x95F4;&#x6D3B;&#x52A8;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5B83;&#x662F;&#x6E90;&#x590D;&#x6742;&#x6027;&#x7684;&#x540C;&#x4E49;&#x8BCD;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x89C6;&#x9891;&#x5E8F;&#x5217;&#x6765;&#x8BF4;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x7684;&#x542B;&#x4E49;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF01;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x89C6;&#x9891;&#x5E8F;&#x5217;&#x7531;&#x4E00;&#x4E2A;&#x5728;&#x89C6;&#x91CE;&#x4E2D;&#x7F13;&#x6162;&#x5E73;&#x79FB;&#x7684;&#x7E41;&#x5FD9;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#xFF0C;&#x5219;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x591A;&#x6BD4;&#x7279;&#xFF0C;&#x56E0;&#x4E3A;&#x65F6;&#x95F4;&#x9884;&#x6D4B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x53C2;&#x8003;&#x56FE;&#x7247;&#x548C;&#x4E00;&#x7CFB;&#x5217;&#x8FD0;&#x52A8;&#x5411;&#x91CF;&#x8F7B;&#x677E;&#x6355;&#x83B7;&#x8FD0;&#x52A8;&#x3002;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65E2;&#x6613;&#x4E8E;&#x8BA1;&#x7B97;&#x53C8;&#x5177;&#x6709;&#x5305;&#x5BB9;&#x6027;&#x7684;&#x89C6;&#x9891;&#x590D;&#x6742;&#x6027;&#x6307;&#x6807;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;</p>
<h5 id="mad">MAD</h5>
<p>&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#x7684;&#x5E73;&#x5747;&#x7EDD;&#x5BF9;&#x5DEE;&#x3002;&#x5BF9;&#x4E8E;&#x901F;&#x7387;&#x63A7;&#x5236;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5E27;&#x95F4;&#x6216;&#x5E27;&#x5185;&#x9884;&#x6D4B;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x540E;&#x7559;&#x4E0B;&#x7684;&#x6B8B;&#x5DEE;&#x7684;&#x7F16;&#x7801;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x9884;&#x6D4B;&#x8BEF;&#x5DEE;&#x7684;&#x5E73;&#x5747;&#x7EDD;&#x5BF9;&#x5DEE;&#x901A;&#x5E38;&#x4E0E;&#x7F16;&#x7801;&#x590D;&#x6742;&#x5EA6;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x5047;&#x8BBE; xi &#x662F;&#x7B2C; i &#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x6E90;&#x503C;</p>
<h5 id="&#x6BD4;&#x7279;&#x7387;&#xFF08;bitrate&#xFF09;">&#x6BD4;&#x7279;&#x7387;&#xFF08;Bitrate&#xFF09;</h5>
<p>&#x7801;&#x7387;&#x662F;&#x6307;&#x4E00;&#x7CFB;&#x5217;&#x56FE;&#x7247;&#x6BCF;&#x79D2;&#x6D88;&#x8017;&#x7684;&#x4F4D;&#x6570;&#xFF0C;&#x5373;&#x7801;&#x7387; =&#xFF08;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x5E73;&#x5747;&#x4F4D;&#x6570;&#xFF09;/&#xFF08;&#x6BCF;&#x79D2;&#x5E27;&#x6570;&#xFF09;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x7B49;&#x540C;&#x4E8E;&#x4E3A;&#x6D41;&#x63D0;&#x4F9B;&#x6216;&#x53EF;&#x7528;&#x7684;&#x53EF;&#x9760;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x3002;</p>
<h5 id="&#x91CF;&#x5316;&#x53C2;&#x6570;&#xFF08;qp&#xFF09;">&#x91CF;&#x5316;&#x53C2;&#x6570;&#xFF08;QP&#xFF09;</h5>
<p>&#x91CF;&#x5316;&#x53C2;&#x6570;&#xFF08;QP&#xFF09;&#x3002;&#x901A;&#x8FC7;&#x8FD1;&#x4F3C;&#x719F;&#x6089;&#x7684;&#x79BB;&#x6563;&#x4F59;&#x5F26;&#x53D8;&#x6362; (DCT) &#x7684;&#x6574;&#x6570;&#x53D8;&#x6362;&#x5C06;&#x6B8B;&#x5DEE;&#x53D8;&#x6362;&#x5230;&#x7A7A;&#x95F4;&#x9891;&#x57DF;&#x3002;&#x91CF;&#x5316;&#x53C2;&#x6570;&#x786E;&#x5B9A;&#x5C06;&#x53D8;&#x6362;&#x7CFB;&#x6570;&#x4E0E;&#x6709;&#x9650;&#x6B65;&#x957F;&#x96C6;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6B65;&#x957F;&#x3002;QP &#x503C;&#x8F83;&#x5927;&#x8868;&#x793A;&#x7C97;&#x7565;&#x5730;&#x8FD1;&#x4F3C;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x7684;&#x8F83;&#x5927;&#x6B65;&#x9AA4;&#xFF0C;&#x56E0;&#x6B64;&#x4EC5;&#x7528;&#x5C11;&#x6570;&#x7CFB;&#x6570;&#x5373;&#x53EF;&#x6355;&#x83B7;&#x5927;&#x90E8;&#x5206;&#x4FE1;&#x53F7;&#x3002;&#x5C0F;&#x7684; QP &#x503C;&#x53EF;&#x4EE5;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8FD1;&#x4F3C;&#x5757;&#x7684;&#x7A7A;&#x95F4;&#x9891;&#x8C31;&#xFF0C;&#x4F46;&#x4EE3;&#x4EF7;&#x662F;&#x66F4;&#x591A;&#x7684;&#x6BD4;&#x7279;&#x3002;&#x5728;H.264&#x4E2D;&#xFF0C;</p>
<h5 id="&#x56FE;&#x7247;&#x7EC4;&#xFF08;gop&#xFF09;">&#x56FE;&#x7247;&#x7EC4;&#xFF08;GOP&#xFF09;</h5>
<p>&#x56FE;&#x50CF;&#x7EC4;&#x6982;&#x5FF5;&#x7EE7;&#x627F;&#x81EA; MPEG&#xFF0C;&#x6307;&#x7684;&#x662F; I &#x56FE;&#x50CF;&#xFF0C;&#x540E;&#x9762;&#x662F;&#x6240;&#x6709; P &#x56FE;&#x50CF;&#x548C; B &#x56FE;&#x50CF;&#xFF0C;&#x76F4;&#x5230;&#x4E0B;&#x4E00;&#x4E2A; I &#x56FE;&#x50CF;&#x3002;&#x5178;&#x578B;&#x7684; MPEG GOP &#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x662F; IBBBPBBPBBI&#x3002;&#x5C3D;&#x7BA1; H.264 &#x5E76;&#x4E0D;&#x4E25;&#x683C;&#x8981;&#x6C42;&#x6BCF;&#x4E2A;&#x89C6;&#x9891;&#x5E8F;&#x5217;&#x8D85;&#x8FC7;&#x4E00;&#x4E2A; I &#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x63A8;&#x8350;&#x7684;&#x901F;&#x7387;&#x63A7;&#x5236;&#x65B9;&#x6CD5;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x91CD;&#x590D;&#x7684; GOP &#x7ED3;&#x6784;&#x624D;&#x80FD;&#x6709;&#x6548;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C; IntraPeriod &#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A; 0&#xFF0C;H.264 &#x901F;&#x7387;&#x63A7;&#x5236;&#x5C06;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<h5 id="&#x57FA;&#x672C;&#x5355;&#x4F4D;">&#x57FA;&#x672C;&#x5355;&#x4F4D;</h5>
<p>&#x5B83;&#x8868;&#x793A;&#x53CD;&#x9988;&#x63A7;&#x5236;&#x73AF;&#x8DEF;&#x4E2D;&#x8C03;&#x6574;QP&#x7684;&#x7C92;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x57FA;&#x672C;&#x5355;&#x5143;&#x662F;&#x56FE;&#x7247;&#xFF0C;&#x5219;&#x901F;&#x7387;&#x63A7;&#x5236;&#x5668;&#x5BF9;QP&#x7684;&#x8C03;&#x6574;&#x5728;&#x6574;&#x4E2A;&#x56FE;&#x7247;&#x4E0A;&#x662F;&#x5747;&#x5300;&#x7684;&#x3002;&#x5728;MPEG-2&#x4E2D;&#xFF0C;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x662F;&#x5B8F;&#x5757;&#x3002;&#x6700;&#x521D;&#xFF0C;&#x5927;&#x591A;&#x6570; H.264 &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x5143;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x9884;&#x8BA1;&#x5B8C;&#x6574;&#x6216;&#x90E8;&#x5206;&#x5B8F;&#x5757;&#x884C;&#x5C06;&#x5728;&#x7EDF;&#x4E00;&#x6BD4;&#x7279;&#x7387;&#x548C;&#x7EDF;&#x4E00;&#x8D28;&#x91CF;&#x4E4B;&#x95F4;&#x4EA7;&#x751F;&#x6700;&#x4F73;&#x6298;&#x8877;&#x3002;</p>
<ul>
<li>&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#x7801;&#x7387;&#xFF0C;&#x4E00;&#x5E27;&#x56FE;&#x50CF;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x7F16;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#xFF0C;&#x540C;&#x4E00;&#x5E27;&#x56FE;&#x50CF;&#x53EF;&#x80FD;&#x4F1A;&#x591A;&#x6B21;&#x7F16;&#x7801;&#xFF0C;&#x7F16;&#x7801;&#x5668;&#x4E00;&#x822C;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x4E00;&#x5E27;&#x56FE;&#x50CF;&#x6700;&#x5927;&#x91CD;&#x7F16;&#x7801;&#x6B21;&#x6570;&#x201D;&#x53C2;&#x6570;&#x3002;</li>
<li>&#x5173;&#x4E8E;&#x56FE;&#x50CF;&#x8D28;&#x91CF;&#x8BC4;&#x4F30;&#x7684;&#x4E00;&#x4E9B;&#x8BC4;&#x4EF7;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x6709;PSNR&#x3001;SSIM&#x3001;VMAF&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x4E0E;B&#x5E27;&#x76F8;&#x6BD4;&#xFF0C;P&#x5E27;&#x5E94;&#x8BE5;&#x83B7;&#x5F97;2-5&#x500D;&#x7684;&#x6BD4;&#x7279;&#x6570;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;I&#x4E0E;P&#x5E27;&#x76F8;&#x6BD4;&#xFF0C;&#x5E27;&#x5E94;&#x5F53;&#x63A5;&#x6536;3&#x500D;&#x7684;&#x6BD4;&#x7279;&#x91CF;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../缩略语.html" class="navigation navigation-prev " aria-label="Previous page: 缩略语">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../Chapter-2/2_QP.html" class="navigation navigation-next " aria-label="Next page: 2 QP">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1 概述","level":"1.3","depth":1,"next":{"title":"2 QP","level":"1.4","depth":1,"path":"book/Chapter-2/2_QP.md","ref":"book/Chapter-2/2_QP.md","articles":[]},"previous":{"title":"缩略语","level":"1.2","depth":1,"path":"book/缩略语.md","ref":"book/缩略语.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"book/Chapter-1/1_概述.md","mtime":"2023-10-11T12:09:22.267Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-10-11T12:10:50.037Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

